# -*- coding: utf-8 -*-
"""
时间：2019-11-16
作者: zuoshao（佐少）
代码说明：正则表达式
"""

# ######################################################################################################################
# 正则表达式Re
# https://www.cnblogs.com/hanmk/p/9143514.html
# ######################################################################################################################

# 关于转义的问题~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
'''
正则表达式中用“\”表示转义，而python中也用“\”表示转义，当遇到特殊字符需要转义时，
你要花费心思到底需要几个“\”，所以为了避免这个情况，墙裂推荐使用原生字符串类型(raw string)来书写正则表达式。
方法很简单，只需要在表达式前面加个“r”即可，如下
'''
a_string = r'\d{2}-\d{8}'
b_string = r'\bt\w*\b'

# 常用的功能函数~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
'''
re.match() 从字符串的起始位置匹配，匹配成功，返回一个匹配的对象，否则返回None。
re.search() 扫描整个字符串并返回第一个成功的匹配。
re.findall() 在字符串中找到正则表达式所匹配的所有子串，并返回一个列表，如果没有找到匹配的，则返回空列表。
re.split() 将一个字符串按照正则表达式匹配结果进行分割，并把他们作为一个迭代器返回
re.finditer() 在字符串中找到正则表达式所匹配的所有子串，并把他们作为一个迭代器返回
re.sub() 把字符串中所有匹配正则表达式的地方替换成新的字符串
'''





