

# ######################################################################################################################
# python多线程数据库连接耗尽问题描述
# ######################################################################################################################
'''

但是你这个一下子连接一坨上去, 连完了又不主动释放(关闭连接), 当然扛不住, 所以有两个解决方法
改大postgresql.conf里的max_connections值, 加大postgresql的默认连接数
query_with_desc函数结尾增加cur.close()及时关闭连接
'''

# ######################################################################################################################
# 数据库连接池
# ######################################################################################################################
'''
postgresql：superuser_reserved_connections（integer）
确定PostgreSQL超级用户为连接保留的连接“ 插槽 ”的数量。最多max_connections个连接可以同时处于活动状态。
只要活动的并发连接数至少为负，则仅超级用户将接受新连接，而新的复制连接将不被接受。
max_connectionssuperuser_reserved_connections默认值为三个连接。
该值必须小于max_connections。该参数只能在服务器启动时设置。
'''

