# -*- coding: utf-8 -*-
"""
时间：2019-10-13
作者: zuoshao（佐少）
代码说明：聚合数据API-彩票开奖结果查询
https://www.juhe.cn/docs/api/id/300
"""

# ######################################################################################################################
# 聚合数据API-彩票开奖结果查询
# 目前支持双色球、大乐透、七乐彩、七星彩、福彩3D、排列3、排列5，数据来源于网络公开，开奖结果获取可能会有一定的延时。
# 同时支持开奖结果查询、历史开奖结果查询、中奖计算器
# ######################################################################################################################

def JuheLottery(lottery_id='ssq', lottery_no='18028'):

    # 导入所需要的模块~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    from urllib.parse import quote
    import pandas as pd
    import requests

    # 高德API请求信息设置~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    appkey = '61615bfbc93cfdc26d9b031ba29f2b2f'
    poi_search_url = "http://apis.juhe.cn/lottery/query"
    req_url = poi_search_url + "?key=" + appkey + "&lottery_id=" + quote(lottery_id) + "&lottery_no=" + quote(lottery_no)

    # 高德API数据请求并解析~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # 访问链接后，api会回传给一个json格式的数据
    data = requests.get(req_url)
    data = data.json()

    # 请求当时天气情况~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    if data['reason'] == '查询成功':
        name_list = ['lottery_id', 'lottery_name', 'lottery_res', 'lottery_no', 'lottery_date', 'lottery_exdate',
                     'lottery_sale_amount', 'lottery_pool_amount', 'lottery_prize']
        # 请求返回信息解析并提取相关的信息~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
        df_data = pd.DataFrame(columns=name_list)

        for name in name_list:
            df_data[name] = [data['result'][name]]

    # 没有请求结果，返回错误信息~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    else:
        print('没有返回结果！请输入正确的区域！')

    # 函数返回结果~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    return df_data

# ######################################################################################################################
# 主函数
# ######################################################################################################################

# 主函数~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
if __name__ == '__main__':
    result = JuheLottery(lottery_id='ssq', lottery_no='18028')


