
# ######################################################################################################################
# zmail简介
'''
Zmail允许您在python中尽可能发送和接收电子邮件。无需检查服务器地址或制作您自己的MIME对象。
使用zmail，您只需要关心您的邮件内容。
一、特征：1、自动查找服务器地址及其端口。2、自动使用合适的协议登录。3、自动将python字典转换为MIME对象（带附件）。
4、自动添加邮件标题和本地名称，以避免服务器拒绝您的邮件。5、轻松自定义邮件标题。
6、支持HTML作为邮件内容。7、只需要python> = 3.5，您可以将其嵌入到项目中而无需其他模块。
二、使用之前，请确保：1、使用python3；2、在您的邮件中打开SMTP / POP3功能（对于@ 163.com和@ gmail.com，
您需要设置您的应用程序私人密码）。3、然后，您只需要导入zmail即可
'''
# ######################################################################################################################

# 验证SMTP和POP功能是否正常工作~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# SMTP和POP工作正常，该函数将返回True，否则返回Fasle。
import zmail

server = zmail.server('3447673917@qq.com', 'znhkybqfmrwncjca')

if server.smtp_able():
    pass      # SMTP function.

if server.pop_able():
    pass      # POP function.

# ######################################################################################################################
# content_text发送纯文本
'''
先从最简单的发送纯文本的邮件开始，调通发送邮件的代码。以腾讯的企业邮箱为例，smtp_host是发送邮箱的smtp服务地址，
不同的邮箱不太一样。 （smtp_host:smtp.exmail.qq.com； smtp_port:465）
QQ邮箱 POP3 和 SMTP 服务器地址设置如下：邮箱POP3服务器(端口110)SMTP服务器(端口25) （qq.com； pop.qq.com）
smtp.qq.com SMTP服务器需要身份验证
'''
# ######################################################################################################################

import zmail

# 编写邮箱信息（主题+正文）~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
mail = {
    'subject': '邮件主题：Success!',  # 邮件主题
    'content_text': '邮件正文内容：This message from zmail! QQ交流群:717225969 ',  # 邮件正文
      }

# 编写发邮箱服务（发件人账户+密码等信息）~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
server = zmail.server('3447673917@qq.com',     # 发件人邮箱号码，该邮箱号码需要开通POP3 和 SMTP 服务。
                      'znhkybqfmrwncjca')      # 发件人邮箱验证信息（不是邮箱密码），该验证信息在开通服务时提供。

# server = zmail.server('3447673917@qq.com',     # 发件人邮箱号码，该邮箱号码需要开通POP3 和 SMTP 服务。
#                       'znhkybqfmrwncjca',      # 发件人邮箱验证信息（不是邮箱密码），该验证信息在开通服务时提供。
#                       smtp_host="smtp.qq.com",  # 发件邮箱服务地址，不同服务其不相同
#                       smtp_port=465)           # 发件邮箱端口号码，不同服务其不行通

# 编写收件人相关信息（收件人账户等）~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
server.send_mail('1432467203@qq.com', mail)  # 第一个参数是接受人邮箱号码，第二个参数是邮件信息。
# server.send_mail(['1432467203@qq.com', '1432467203@qq.com'], mail)  # 同时有两个收件人。

# 收件箱信息查询~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
latest_mail = server.get_latest()
zmail.show(latest_mail)

# ######################################################################################################################
# content_text发送附件
''' 
您可以通过添加 'from':'Boss <mymail@foo.com>'邮件来定义发件人的姓名。
你也可以命名它们（使用元组，首先是它的名字，下一个是它的地址）
server.send_mail([(‘Boss’,’yourfriend@example.com’),’12345@example.com’], mail)
'''
# ######################################################################################################################

import zmail

mail = {
        'subject': 'Success!',  # 主题
        'content_text': 'This message from zmail!',  # 正文
        'attachments': [r'D:\DownLoad\谷歌下载\权重的确定方法汇总.docx',
                        r'D:\DownLoad\谷歌下载\runke.xyz.certificate.jpg'],  # 选择附件，最好用绝对路径.
        }
server = zmail.server('3447673917@qq.com', 'znhkybqfmrwncjca')

server.send_mail('1432467203@qq.com', mail)

# ######################################################################################################################
# 发送HTML内容
# ######################################################################################################################

# 方法1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
mail = {
        'subject': 'Success!',  # Anything you want.
        'content_html': ['HTML CONTENT'],
        'attachments': r'D:\DownLoad\谷歌下载\权重的确定方法汇总.docx',  # Absolute path will be better.
        }
server.send_mail('yourfriend@example.com',mail)

# 方法2~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
with open(r'D:\DownLoad\谷歌下载\python笔记37-史上最好用的发邮件zmail - 云+社区 - 腾讯云.html','r') as f:
    content_html = f.read()

mail = {
        'subject': 'Success!',  # Anything you want.
        'content_html': content_html,
        'attachments': r'D:\DownLoad\谷歌下载\权重的确定方法汇总.docx',  # Absolute path will be better.
        }
server.send_mail('yourfriend@example.com',mail)

# ######################################################################################################################
# 使用抄送
# ######################################################################################################################

server.send_mail(['foo@163.com', 'foo@126.com'], mail, cc=['bar@163.com'])

# 同样，你也可以命名它们（使用元组，首先是它的名字，下一个是它的地址）
server.send_mail(['foo@163.com', 'foo@126.com'],mail,cc=[('Boss', 'bar@163.com'), 'bar@126.com'])

# ######################################################################################################################
# 自定义您的服务器
# ######################################################################################################################

server = zmail.server('username', 'password',
                    smtp_host='smtp.163.com', smtp_port=994, smtp_ssl=True,
                    pop_host='pop.163.com', pop_port=995, pop_tls=True)

# ######################################################################################################################
# 收到你的邮件
# ######################################################################################################################

# 获取最新邮件
import zmail
server = zmail.server('yourmail@example.com', 'yourpassword')
mail = server.get_latest()

# 通过其ID检索邮件。
mail = server.get_mail(2)

# 获取邮件列表（主题，之后，之前，发件人）
mail = server.get_mails(subject='GitHub',start_time='2018-1-1',sender='github')

# 在示例中，如果’GitHub’在邮件的主题中，它将被匹配，例如’[GitHub]您的密码已更改’，发件人是一样的。
# 您还可以指定邮件范围。
mail = server.get_mails(subject='GitHub', start_time='2018-1-1', sender='github', start_index=1, end_index=10)

# ######################################################################################################################
# 解析你的邮件
# ######################################################################################################################

# 在zmail中，所有邮件都将映射到python字典，您可以通过访问您的邮件~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
subject = mail['subject']

# 显示邮件，使用zmail.show()~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
import zmail
server = zmail.server('yourmail@example.com', 'yourpassword')
mail = server.get_latest()
zmail.show(mail)

# 查看邮件中的所有内容。~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
import zmail
server = zmail.server('yourmail@example.com', 'yourpassword')
mail = server.get_latest()
for k, v in mail.items():
    print(k, v)